tap "heroku/brew" # Heroku CLI
tap "homebrew/cask-fonts"
tap "homebrew/services"

brew "aichat" # ChatGPT
brew "bash" # Shell
brew "bat" # Display file content
brew "circleci" # local CI
brew "curl" # HTTP client
brew "direnv" # Environment variable management
brew "exercism" # Practice programming
brew "fd" # Find files
brew "gcc"
brew "gh" # GitHub CLI
brew "git" # VCS
brew "gitui" # TUI for Git
brew "git-delta" # Pager for Git
brew "gnu-sed" # Sed, but GNU
brew "graphviz" # Visualization
brew "heroku" # Heroku CI
brew "htop" # System usage
brew "imagemagick" # Convert images
brew "jq" # Process JSON
brew "marp-cli" # Generate slides from Markdown
brew "mysql" # RDBMS
brew "neovim" # Editor
brew "rbenv" # Ruby environment mamagement
brew "redis" # KVS
brew "ripgrep" # Grep
brew "ruby-build" # Install Ruby
brew "sheldon" # Shell framework
brew "shellcheck" # Shell Lint
brew "sqlite" # RDBMS
brew "thefuck" # Command correction
brew "tree" # `tree` command
brew "vim" # Editor
brew "wget" # HTTP client
brew "yarn" # Package manager for Node.js
brew "zsh" # Shell

cask "1password" # Password manager
cask "1password-cli" # Password manager
cask "brave-browser" # Browser
cask "dash" # Document viewer
cask "discord" # Communication
cask "docker" # Container
cask "dropbox" # File sharing
cask "element" # Communication
cask "fing" # Network utilities
cask "firefox" # Browser
cask "firefox-developer-edition" # Browser
cask "font-hackgen" # Font
cask "font-hackgen-nerd" # Font
cask "github" # GitHub GUI
cask "google-chrome" # Browser
cask "google-drive" # File sharing
cask "iina" # Movie player
cask "iterm2" # Terminal
cask "jetbrains-toolbox" # Jetbrain tool management
cask "carabiner-elements" # Keyboard modifier
cask "lulu" # Firewall
cask "messenger" # Communication
cask "microsoft-teams" # Communication
cask "ngrok" # Proxy
cask "obsidian" # Markdown editor
cask "postgres-unofficial" # RDBMS
cask "postico" # Postgres client
cask "raindropio" # Bookmark management
cask "raycast" # Launcher
cask "scrivener" # Writing tool
cask "spotify" # Music
cask "thorium" # EPUB reader
cask "ticktick" # TODO management
cask "timing" # Time management
cask "visual-studio-code" # Editor
